vvpai9/Keil/Keil_v5/ARM/Pack/.Web/SiliconLabs.GeckoPlatform_EFR32MG24_DFP.pdsc
        <!-- *************************  Device 'EFR32MG24A020F1536IM40'  ***************************** -->
        <device Dname="EFR32MG24A020F1536IM40">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A020F1536IM40"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A020F1536IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG24A020F1536IM48'  ***************************** -->
        <device Dname="EFR32MG24A020F1536IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A020F1536IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A020F1536IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG24A020F768IM40'  ***************************** -->
        <device Dname="EFR32MG24A020F768IM40">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A020F768IM40"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A020F768IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24A021">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24A021 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24A021 Errata"/>
        <!-- *************************  Device 'EFR32MG24A021F1024IM40'  ***************************** -->
        <device Dname="EFR32MG24A021F1024IM40">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A021F1024IM40"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A021F1024IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24A110">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24A110 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24A110 Errata"/>
        <!-- *************************  Device 'EFR32MG24A110F1024IM48'  ***************************** -->
        <device Dname="EFR32MG24A110F1024IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A110F1024IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A110F1024IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG24A110F1536GM48'  ***************************** -->
        <device Dname="EFR32MG24A110F1536GM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A110F1536GM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A110F1536GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24A111">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24A111 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24A111 Errata"/>
        <!-- *************************  Device 'EFR32MG24A111F1536GM48'  ***************************** -->
        <device Dname="EFR32MG24A111F1536GM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A111F1536GM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A111F1536GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24A120">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24A120 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24A120 Errata"/>
        <!-- *************************  Device 'EFR32MG24A120F1536GM48'  ***************************** -->
        <device Dname="EFR32MG24A120F1536GM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A120F1536GM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A120F1536GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24A121">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24A121 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24A121 Errata"/>
        <!-- *************************  Device 'EFR32MG24A121F1536GM48'  ***************************** -->
        <device Dname="EFR32MG24A121F1536GM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A121F1536GM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A121F1536GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24A410">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24A410 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24A410 Errata"/>
        <!-- *************************  Device 'EFR32MG24A410F1536IM40'  ***************************** -->
        <device Dname="EFR32MG24A410F1536IM40">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A410F1536IM40"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A410F1536IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG24A410F1536IM48'  ***************************** -->
        <device Dname="EFR32MG24A410F1536IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A410F1536IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A410F1536IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24A420">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24A420 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24A420 Errata"/>
        <!-- *************************  Device 'EFR32MG24A420F1536IM40'  ***************************** -->
        <device Dname="EFR32MG24A420F1536IM40">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A420F1536IM40"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A420F1536IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG24A420F1536IM48'  ***************************** -->
        <device Dname="EFR32MG24A420F1536IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A420F1536IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A420F1536IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24A610">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24A610 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24A610 Errata"/>
        <!-- *************************  Device 'EFR32MG24A610F1536IM40'  ***************************** -->
        <device Dname="EFR32MG24A610F1536IM40">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A610F1536IM40"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A610F1536IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24A620">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24A620 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24A620 Errata"/>
        <!-- *************************  Device 'EFR32MG24A620F1536IM40'  ***************************** -->
        <device Dname="EFR32MG24A620F1536IM40">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24A620F1536IM40"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24A620F1536IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24B010">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24B010 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24B010 Errata"/>
        <!-- *************************  Device 'EFR32MG24B010F1024IM48'  ***************************** -->
        <device Dname="EFR32MG24B010F1024IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B010F1024IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B010F1024IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG24B010F1536IM40'  ***************************** -->
        <device Dname="EFR32MG24B010F1536IM40">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B010F1536IM40"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B010F1536IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG24B010F1536IM48'  ***************************** -->
        <device Dname="EFR32MG24B010F1536IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B010F1536IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B010F1536IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24B020">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24B020 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24B020 Errata"/>
        <!-- *************************  Device 'EFR32MG24B020F1024IM48'  ***************************** -->
        <device Dname="EFR32MG24B020F1024IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B020F1024IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B020F1024IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

