vvpai9/Keil/Keil_v5/ARM/Pack/.Web/SiliconLabs.GeckoPlatform_EFR32MG24_DFP.pdsc
        <!-- *************************  Device 'EFR32MG24B020F1536IM40'  ***************************** -->
        <device Dname="EFR32MG24B020F1536IM40">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B020F1536IM40"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B020F1536IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG24B020F1536IM48'  ***************************** -->
        <device Dname="EFR32MG24B020F1536IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B020F1536IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B020F1536IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24B110">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24B110 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24B110 Errata"/>
        <!-- *************************  Device 'EFR32MG24B110F1536GM48'  ***************************** -->
        <device Dname="EFR32MG24B110F1536GM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B110F1536GM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B110F1536GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG24B110F1536IM48'  ***************************** -->
        <device Dname="EFR32MG24B110F1536IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B110F1536IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B110F1536IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24B120">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24B120 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24B120 Errata"/>
        <!-- *************************  Device 'EFR32MG24B120F1536IM48'  ***************************** -->
        <device Dname="EFR32MG24B120F1536IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B120F1536IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B120F1536IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24B210">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24B210 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24B210 Errata"/>
        <!-- *************************  Device 'EFR32MG24B210F1536IM40'  ***************************** -->
        <device Dname="EFR32MG24B210F1536IM40">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B210F1536IM40"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B210F1536IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG24B210F1536IM48'  ***************************** -->
        <device Dname="EFR32MG24B210F1536IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B210F1536IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B210F1536IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24B220">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24B220 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24B220 Errata"/>
        <!-- *************************  Device 'EFR32MG24B220F1536IM48'  ***************************** -->
        <device Dname="EFR32MG24B220F1536IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B220F1536IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B220F1536IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24B310">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24B310 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24B310 Errata"/>
        <!-- *************************  Device 'EFR32MG24B310F1536IM48'  ***************************** -->
        <device Dname="EFR32MG24B310F1536IM48">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B310F1536IM48"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B310F1536IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG24B610">
        <book         name="Documents/efr32mg24-datasheet.pdf"      title="EFR32MG24B610 Data Sheet"/>
        <book         name="Documents/efr32mg24-errata.pdf"         title="EFR32MG24B610 Errata"/>
        <!-- *************************  Device 'EFR32MG24B610F1536IM40'  ***************************** -->
        <device Dname="EFR32MG24B610F1536IM40">
          <compile header="Device/SiliconLabs/EFR32MG24/Include/em_device.h"  define="EFR32MG24B610F1536IM40"/>
          <debug      svd="SVD/EFR32MG24/EFR32MG24B610F1536IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFR32MG24">
      <description>Silicon Labs EFR32MG24 device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFR32MG24*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2025.6.2" condition="EFR32MG24">
      <description>System Startup for Silicon Labs EFR32MG24 device series</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/SiliconLabs/EFR32MG24/Include/"/>
        <file category="header"  name="Device/SiliconLabs/EFR32MG24/Include/em_device.h"/>
        <!-- system file -->
        <file category="source"  name="Device/SiliconLabs/EFR32MG24/Source/system_efr32mg24.c" attr="config" version="2025.6.2"/>
      </files>
    </component>
  </components>
</package>
